In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
ser1 = Series(np.arange(3), index = ['a', 'b', 'c'])
ser1

a    0
b    1
c    2
dtype: int64

In [3]:
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int64

In [4]:
ser1.a

0

In [5]:
ser1.c

4

In [7]:
ser1['a']

0

In [8]:
ser1[2]

4

In [9]:
ser1[0:5]

a    0
b    2
c    4
dtype: int64

In [10]:
ser1[['a', 'c']]

a    0
c    4
dtype: int64

In [12]:
ser1[ser1 > 3]

c    4
dtype: int64

In [13]:
ser1[ser1 > 3] = 10
ser1

a     0
b     2
c    10
dtype: int64

In [14]:
df = DataFrame(np.arange(25).reshape((5, 5)), index = ['NYC', 'SF', 'LA', 'DC', 'CHI'],
               columns = ['A', 'B', 'C', 'D', 'E'])
df

      A   B   C   D   E
NYC   0   1   2   3   4
SF    5   6   7   8   9
LA   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [17]:
df['B']

NYC     1
SF      6
LA     11
DC     16
CHI    21
Name: B, dtype: int64

In [18]:
df[['A', 'D']]

      A   D
NYC   0   3
SF    5   8
LA   10  13
DC   15  18
CHI  20  23

In [19]:
df[df['B'] > 8]

      A   B   C   D   E
LA   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [20]:
df > 10

         A      B      C      D      E
NYC  False  False  False  False  False
SF   False  False  False  False  False
LA   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [21]:
df.loc['CHI']

A    20
B    21
C    22
D    23
E    24
Name: CHI, dtype: int64

In [22]:
df.iloc[3]

A    15
B    16
C    17
D    18
E    19
Name: DC, dtype: int64